CSI API ETABS v1
cCaseStaticNonlinearStaged.SetStageData Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetStageData(
	string Name,
	int Stage,
	int NumberOperations,
	ref int[] Operation,
	ref string[] GroupName,
	ref int[] Age,
	ref string[] LoadType,
	ref string[] LoadName,
	ref double[] SF
)
Function SetStageData (
	Name As String,
	Stage As Integer,
	NumberOperations As Integer,
	ByRef Operation As Integer(),
	ByRef GroupName As String(),
	ByRef Age As Integer(),
	ByRef LoadType As String(),
	ByRef LoadName As String(),
	ByRef SF As Double()
) As Integer
Dim instance As cCaseStaticNonlinearStaged
Dim Name As String
Dim Stage As Integer
Dim NumberOperations As Integer
Dim Operation As Integer()
Dim GroupName As String()
Dim Age As Integer()
Dim LoadType As String()
Dim LoadName As String()
Dim SF As Double()
Dim returnValue As Integer
returnValue = instance.SetStageData(Name,
	Stage, NumberOperations, Operation,
	GroupName, Age, LoadType, LoadName,
	SF)
int SetStageData(
	String^ Name,
	int Stage,
	int NumberOperations,
	array<int>^% Operation,
	array<String^>^% GroupName,
	array<int>^% Age,
	array<String^>^% LoadType,
	array<String^>^% LoadName,
	array<double>^% SF
)
abstract SetStageData :
        Name : string *
        Stage : int *
        NumberOperations : int *
        Operation : int[] byref *
        GroupName : string[] byref *
        Age : int[] byref *
        LoadType : string[] byref *
        LoadName : string[] byref *
        SF : float[] byref -> int
Parameters
Name
Type: System.String
Stage
Type: System.Int32
NumberOperations
Type: System.Int32
Operation
Type: System.Int32[]
GroupName
Type: System.String[]
Age
Type: System.Int32[]
LoadType
Type: System.String[]
LoadName
Type: System.String[]
SF
Type: System.Double[]
Return Value
Type: Int32
See Also
Reference
cCaseStaticNonlinearStaged Interface
ETABSv1 Namespace